package by.belhard.j22.homeworks.hw_06.ht_06_05_entity_map;

//Возьмем класс из предыдущего задания.
//Создадим словарь Map<Entity, List<String>> entityMap = … ,
// то есть словарь хранит пары, в которых ключ – объект класса Entity, а значение – список строк.
//Запишем в entityMap 5 пар.
//например, первая пара [new Entity(“Vasily”) : new ArrayList<>(){{add.(“milk”);add(“bread”);}}]
//вторая пара [new Entity(“Ivan”) : new ArrayList<>(){{add.(“bread”); add.(“butter”); add.(“solt”);}}]
//… и т.д.
// Будем считать, что это какие-то люди и список их покупок.
//Посчитать, сколько штук каждого продукта всего надо купить
// и вывести на консоль список покупок по продуктам, можно еще отсортировать по алфавиту.

public class MapTask {
}
