package by.belhard.j22.homeworks.hw_06.ht_06_08_basket;

// Реализовать модель: Есть класс Корзина, в которую можно класть некоторое количество товаров и услуг,
// например, 2 картофелин и 0.5 часа стрижки.
// Товар имеет какую-то стоимость за штуку.
// Услуга имеет стоимость за единицу времени, для каждой услуги она своя.
// (например, стрижка имеет цену 7 рублей за 0.25 часа, а баня – 25 рублей за час).
// Естественно, Товары и Услуги – это абстрактные классы, нужно будет придумать несколько конкретных классов.
// В Корзине должна быть реализована возможность узнать общую стоимость товаров и услуг в корзине.

public class Basket {

}
