package by.belhard.j22.homeworks.hw_06.ht_06_07_symbols;

//Реализовать «частотный словарь символов».
// Есть какая-то строка. Посчитать, сколько раз каждый символ встречается в строке.
// Вывести на консоль результат подсчетов.
// В задаче используется какая-то из реализаций интерфейса Map.
// Чтобы получить массив символов из строки, используйте str.toCharArray().
//Доп: Считать большие и маленькие буквы одинаковыми,
// вывести количество по каждой встречающейся букве, количество пробелов и количество знаков препинания.
// Для решения изучите статические методы класса Character.

public class SymbolsDictionary {
}
